tutorials/OF171/pistonTank/constant/transportProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/Users/egp/OpenFOAM/egp-1.3/run/TAP";
    case            "floatBlock";
    instance        "constant";
    local           "";

    class           dictionary;
    object          transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1
{
    transportModel  Newtonian;
    rho             rho [1 -3 0 0 0 0 0] 1025;
    nu              nu [0 2 -1 0 0 0 0] 1e-06;
    CrossPowerLawCoeffs
    {
        nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
        nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
        m               m [0 0 1 0 0 0 0] 1;
        n               n [0 0 0 0 0 0 0] 0;
    }
    BirdCarreauCoeffs
    {
        nu0             nu0 [0 2 -1 0 0 0 0] 0.0142515;
        nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
        k               k [0 0 1 0 0 0 0] 99.6;
        n               n [0 0 0 0 0 0 0] 0.1003;
    }
}

phase2
{
    transportModel  Newtonian;
    rho             rho [1 -3 0 0 0 0 0]  1;
    nu              nu [0 2 -1 0 0 0 0] 1.48e-05;
    CrossPowerLawCoeffs
    {
        nu0             nu0 [0 2 -1 0 0 0 0] 1e-06;
        nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
        m               m [0 0 1 0 0 0 0] 1;
        n               n [0 0 0 0 0 0 0] 0;
    }
    BirdCarreauCoeffs
    {
        nu0             nu0 [0 2 -1 0 0 0 0] 0.0142515;
        nuInf           nuInf [0 2 -1 0 0 0 0] 1e-06;
        k               k [0 0 1 0 0 0 0] 99.6;
        n               n [0 0 0 0 0 0 0] 0.1003;
    }
}

sigma           sigma [1 0 -2 0 0 0 0] 0.07;


// ************************************************************************* //
